Autodesk.Revit.DB.SlabEdge.AddSegment(Autodesk.Revit.DB.Reference)
Add segments to the slab edge.
targetRef: Segment's reference on which want to be added.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
This exception will be thrown in following cases:
1. Input targetRef is null.
2. Input targetRef is not null but contains nothing.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This exception will be thrown in following cases:
1. Input targetRef has already been added into the slab edge.
2. Internal code fails to create the segment object.
3. Regeneration fails.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
This exception will be thrown if the reference is suitable for creating a slab edge as required.
The reference allowed is :
1.	Model Line
2.	Floor's horizontal edges
3.	Other slab edge's horizontal edges

Autodesk.Revit.DB.SlabEdge.SlabEdgeType
Retrieves/set an object that represents the type of the SlabEdge.

Autodesk.Revit.DB.SlabEdge
An object that represents a slab edge within the Autodesk Revit project.
Remarks: This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.